// Создайте страницу, которая отобразит сообщение «Я JavaScript!»
// alert ('Я в Javascrript')

// ---------------ПЕРЕМЕННЫЕ-------------------------------------
// 1.Объявите две переменные: admin и name.
// let admin,name;

// 2.Запишите строку "Джон" в переменную name.
// name = "Джон";

// 3.Скопируйте значение из переменной name в admin.
// admin = name;

// 4Выведите на экран значение admin, используя функцию alert (должна показать «Джон»).
// alert(admin);


//-----------------Взаимодействие: alert, prompt, confirm-------------

// Создайте страницу, которая спрашивает имя у пользователя и выводит его
let userName=prompt ("Введите Ваше имя!");
alert(`Добрый день! ${userName}`);